class Url:
    YANDEX_SCOOTER_URL = 'https://qa-scooter.praktikum-services.ru/' # главная страница Яндекс самоката
    YANDEX_SCOOTER_ORDER_URL = 'https://qa-scooter.praktikum-services.ru/order' # страница заказа самоката
    DZEN_URL = 'https://dzen.ru/?yredirect=true' # страница Дзена

class TextQuestion:
    text_1_question = "Сутки — 400 рублей. Оплата курьеру — наличными или картой."
    text_2_question = "Пока что у нас так: один заказ — один самокат. Если хотите покататься с друзьями, можете просто сделать несколько заказов — один за другим."
    text_3_question = "Допустим, вы оформляете заказ на 8 мая. Мы привозим самокат 8 мая в течение дня. Отсчёт времени аренды начинается с момента, когда вы оплатите заказ курьеру. Если мы привезли самокат 8 мая в 20:30, суточная аренда закончится 9 мая в 20:30."
    text_4_question = "Только начиная с завтрашнего дня. Но скоро станем расторопнее."
    text_5_question = "Пока что нет! Но если что-то срочное — всегда можно позвонить в поддержку по красивому номеру 1010."
    text_6_question = "Самокат приезжает к вам с полной зарядкой. Этого хватает на восемь суток — даже если будете кататься без передышек и во сне. Зарядка не понадобится."
    text_7_question = "Да, пока самокат не привезли. Штрафа не будет, объяснительной записки тоже не попросим. Все же свои."
    text_8_question = "Да, обязательно. Всем самокатов! И Москве, и Московской области."

class UsersData:
    name_1 = 'Булат' 
    surname_1 = 'Петин'
    address_1 = 'Москва, ул. Ивантеевская, д. 23'
    phone_1 = '+79998887766'
    date_1 = '10.10.2025'
    comment_1 = 'Предупредить за час'
    name_2 = 'Вася'
    surname_2 = 'Пупкин'
    address_2 = 'Москва, ул. Окружной проезд, д. 2'
    phone_2 = '+71112223344'
    date_2 = '11.11.2025'
    comment_2 = 'Не звонить, прислать СМС'
